---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.MustAddKing
source: html/36ffd4f8-7bdf-81fb-47f0-091b1ebe997b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.MustAddKing Property

In order to add this '[Serf]' to the Option Set, you must also add its '[King]'--if you continue it will not be added to the Option Set

## Syntax (C#)
```csharp
public static FailureDefinitionId MustAddKing { get; }
```